tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "openrtm/omniorb"
tap "openrtm/openrtm"
tap "openrtm/openrtm2"

# brew packages
brew "little-cms2"
brew "aom"
brew "automake"
brew "openssl@3"
brew "balena-cli"
brew "gcc"
brew "create-dmg"
brew "pkg-config"
brew "emacs"
brew "python@3.11"
brew "eye-d3"
brew "ffmpeg"
brew "freeglut"
brew "gawk"
brew "glfw"
brew "glui"
brew "id3v2"
brew "lftp"
brew "mas"
brew "mesa-glu"
brew "nmap"
brew "python@3.8", link: false
brew "python@3.9", link: false
brew "python@3.10", link: false
brew "python@3.11"
brew "opencv@3"
brew "rust"
brew "sha2"
brew "unzip"
brew "wget"
brew "xauth"
brew "youtube-dl"
brew "openrtm/ode/ode"
brew "openrtm/omniorb/omniorb-ssl-py38", link: false
brew "openrtm/omniorb/omniorb-ssl-py39", link: false
brew "openrtm/omniorb/omniorb-ssl-py310", link: false
brew "openrtm/omniorb/omniorb-ssl-py311"
brew "openrtm/omniorb/omniorbpy-py38", link: false
brew "openrtm/omniorb/omniorbpy-py39", link: false
brew "openrtm/omniorb/omniorbpy-py310", link: false
brew "openrtm/omniorb/omniorbpy-py311"

# casks
cask "adoptopenjdk8"
cask "betterdisplay"
cask "blackhole-16ch"
cask "blackhole-2ch"
cask "cloudcompare"
cask "docker"
cask "dropbox"
cask "evernote"
cask "eqmac"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "gotomeeting"
cask "handbrake"
cask "iterm2"
cask "macfuse"
cask "macs-fan-control"
cask "meshlab"
cask "messenger"
cask "obs"
cask "onedrive"
cask "openrtp2-ja"
cask "parallels"
cask "qgis"
cask "sage"
cask "shiftit"
cask "sketchup"
cask "skype"
cask "slack"
cask "the-unarchiver"
cask "utm"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webex"
cask "xquartz"
cask "zoom"

#cask "qoobar"
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

# vs-code plugins
vscode "Asuka.insertnumbers"
vscode "austin.code-gnu-global"
vscode "cschlosser.doxdocgen"
vscode "dmnsgn.vscode-wavefront"
vscode "gencay.vscode-chatgpt"
vscode "GitHub.copilot"
vscode "GitHub.vscode-pull-request-github"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "redhat.java"
vscode "SayCV.fix-markdown-toc"
vscode "slevesque.vscode-3dviewer"
vscode "stkb.rewrap"
vscode "torn4dom4n.latex-support"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "xaver.clang-format"
